---
kind: other
id: Properties.T:Autodesk.Revit.DB.DeleteElements
source: html/b0277062-362c-e6df-ca4b-a20ad6720604.htm
---
# DeleteElements Properties

Specifies whether the .NET object represents a valid Revit entity.